1. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

Sample DataFrame: <br>
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], <br>
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], <br>
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} <br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'] <br>

2. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

Sample DataFrame: <br>
Sample Python dictionary data and list labels: <br>
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],<br>
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],<br>
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],<br>
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}<br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']<br>

3. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

<center> Original DataFrame:</center>

|| attempts | name | qualify | score |
| --- | --- | --- | --- | --- |
0 |1 |Anastasia| yes| 12.5|
1 |3 |Dima| no| 9.0|
2 |2 |Katherine| yes| 16.5|
3 |3 |James| no| NaN|
4 |2 |Emily| no| 9.0|
5 |3 |Michael| yes| 20.0|
6 |1 |Matthew| yes| 14.5|
7 |1 |Laura| no| NaN|
8 |2 |Kevin| no| 8.0|
9 |1 |Jonas| yes| 19.0|

<center>New DataFrame replacing all NaN with 0:</center>

|| attempts | name | qualify | score |
| --- | --- | --- | --- | --- |
0 |1 |Anastasia| yes| 12.5|
1 |3 |Dima| no| 9.0|
2 |2 |Katherine| yes| 16.5|
3 |3 |James| no| 0.0|
4 |2 |Emily| no| 9.0|
5 |3 |Michael| yes| 20.0|
6 |1 |Matthew| yes| 14.5|
7 |1 |Laura| no| 0.0|
8 |2 |Kevin| no| 8.0|
9 |1 |Jonas| yes| 19.0|

4. Write a Pandas program to check whether a given column is present in a DataFrame or not. 

<center>Original DataFrame:</center>

|(index)| col1 | col2 | col3 |
| --- | --- | --- | --- |
0| 1| 4| 7<br>
1| 2| 5| 8<br>
2| 3| 6| 12<br>
3| 4| 9| 1<br>
4| 7| 5| 11<br>

Hint: <br>
Col4 is not present in DataFrame.<br>
Col1 is present in DataFrame.<br>

5. Write a Pandas program to insert a given column (col1) at a specific column index (first) in a DataFrame.

<center> Original DataFrame: </center>

|| col2 | col3 | 
| --- | --- | --- |
0| 4| 7 <br>
1| 5| 8 <br>
2| 6| 12 <br>
3| 9| 1 <br>
4| 5| 11 <br>

<center> New DataFrame: </center>

|| col1 | col2 | col3 |
| --- | --- | --- | --- |
0| 1| 4| 7 <br>
1| 2| 5| 8 <br>
2| 3| 6| 12 <br>
3| 4| 9| 1 <br>
4| 7| 5| 11 <br>

6. Write a Pandas program to group by the first column and get second column as lists in rows.

<center> Original DataFrame: </center>

|| col1 | col2 | 
| --- | --- | --- |
0| C1| 1 <br>
1| C1| 2 <br>
2| C2| 3 <br>
3| C2| 3 <br>
4| C2| 4 <br>
5| C3| 6 <br>
6| C2| 5 <br>

7. Write a Pandas program to select all columns, except one given column (col3) in a DataFrame. 

<center> Original DataFrame: </center>

|| col1 | col2 | col3 |
| --- | --- | --- | --- |
0| 1| 4| 7 <br>
1| 2| 5| 8 <br>
2| 3| 6| 12 <br>
3| 4| 9| 1 <br>
4| 7| 5| 11 <br>

8. Write a Pandas program to count number of columns of a DataFrame. 

<center> Original DataFrame: </center>

|| col1 | col2 | col3 |
| --- | --- | --- | --- |
0| 1| 4| 7 <br>
1| 2| 5| 8 <br>
2| 3| 6| 12 <br>
3| 4| 9| 1 <br>
4| 7| 5| 11 <br>

9. Write a Pandas program to get topmost n records within each group of a DataFrame. 

<center> Original DataFrame: </center>

|| col1 | col2 | col3 |
| --- | --- | --- | --- |
0| 1| 4| 7 <br>
1| 2| 5| 5 <br>
2| 3| 6| 8 <br>
3| 4| 9| 12 <br>
4| 7| 5| 1 <br>
5| 11| 0| 11 <br>

10. Write a Pandas program to split the following dataframe into groups, group by month and year based on order date and find the total purchase amount year wise, month wise.

<center> Test Data:</center>

|| ord_no | purch_amt | ord_date | customer_id | salesman_id |
| --- | --- | --- | --- | --- | --- |
0|    70001|     150.50  |05-10-2012|         3001|         5002<br>
1 |   70009 |    270.65 | 09-10-2012 |        3001 |        5005<br>
2  |  70002  |    65.26|  05-10-2012  |       3005  |       5001<br>
3   | 70004   |  110.50  |08-17-2012   |      3001   |      5003<br>
4    |70007    | 948.50 | 10-09-2012    |     3005    |     5002<br>
5|    70005|    2400.60|  07-27-2012     |    3001     |    5001<br>
6 |   70008 |   5760.00  |10-09-2012      |   3005      |   5001<br>
7  |  70010  |  1983.43 | 10-10-2012       |  3001       |  5006<br>
8   | 70003   | 2480.40|  10-10-2012        | 3005        | 5003<br>
9    |70012    | 250.45  |06-17-2012         |3001         |5002<br>
10|   70011     | 75.29 | 07-08-2012        | 3005        | 5007<br>
11 |  70013|    3045.60|  04-25-2012       |  3005       |  5001<br>

11. Write a Pandas program to split a given dataframe into groups and list all the keys from the GroupBy object.

<center> Test Data: </center>

|| school_code | class | name | date_of_birth | age | height | weight | address |
| --- | --- | --- | --- | --- | --- | --- | --- | --- |
S1|        s001     |V|  Alberto Franco     |15/05/2002|   12     |173|      35| street1  <br>
S2 |       s002    | V |   Gino Mcneill    | 17/05/2002 |  12    | 192 |     32| street2  <br>
S3  |      s003   | VI  |   Ryan Parkes   |  16/02/1999  | 13   |  186  |    33| street3  <br>
S4   |     s001  |  VI   | Eesha Hinton  |   25/09/1998   |13  |   167   |   30| street1  <br>
S5    |    s002 |    V    |Gino Mcneill |    11/05/2002  | 14 |    151    |  31| street2  <br>
S6     |   s004|    VI   | David Parkes|     15/09/1997 |  12|     159     | 32| street3  <br>

12. Write a Pandas program to split a given dataset using group by on multiple columns and drop last n rows of from each group.

<center>Test Data:</center>

|| ord_no | purch_amt | ord_date | customer_id |
| --- | --- | --- | --- | --- | 
0|    70001|     150.50|  2012-10-05|         3002|         5002<br>
1 |   70009 |    270.65 | 2012-09-10 |        3001 |        5003<br>
2  |  70002  |    65.26  |2012-10-05  |       3001  |       5001<br>
3   | 70004   |  110.50|  2012-08-17   |      3003   |      5003<br>
4    |70007    | 948.50 | 2012-09-10    |     3002    |     5002<br>
5    |70005    |2400.60  |2012-07-27     |    3002     |    5001<br>
6|    70008   | 5760.00|  2012-09-10      |   3001      |   5001<br>
7 |   70010   | 1983.43 | 2012-10-10       |  3004       |  5003<br>
8  |  70003   | 2480.40  |2012-10-10        | 3003        | 5003<br>
9   | 70012    | 250.45|  2012-06-27         |3002         |5002<br>
10   |70011     | 75.29 | 2012-08-17        | 3003        | 5003<br>
11  | 70013   | 3045.60  |2012-04-25       |  3001       |  5001<br>

13. Write a Pandas program to find out the 'WHO region, 'Country', 'Beverage Types' in the year '1986' or '1989' where WHO region is 'Americas' or 'Europe' from the world alcohol consumption dataset. 

<center>World alcohol consumption data example:</center>

|| Year | WHO region |  Country | Beverage Types | Display Value |
| --- | --- | --- | --- | --- | --- |
0|  1986|  Western Pacific    |           Viet Nam|           Wine    |       0.00<br>
1 | 1986 |        Americas   |             Uruguay |         Other   |        0.50<br>
2  |1985  |         Africa  |         Cte d'Ivoire  |         Wine  |         1.62<br>
3  |1986   |      Americas |              Colombia   |        Beer |          4.27<br>
4  |1987    |     Americas|  Saint Kitts and Nevis    |       Beer|           1.98<br>

14. Write a Pandas program to filter all records starting from the 2nd row, access every 5th row from world alcohol consumption dataset. Data: world_alcohol.csv

15. Write a Pandas program to filter rows based on row numbers ended with 0, like 0, 10, 20, 30 from world alcohol consumption dataset. Data: world_alcohol.csv